DO/Scenario 1.5/DO_16_Delete_DO_Detail_by_ID_softdelete.yaml
# "https://moonlay-api.dbo.dev/order-srv/delivery-orders//detail/${csvData[i].do_detail_id}"

# https://moonlay-api.dbo.dev/order-srv/delivery-orders/${csvData[i].id}

config:
  payload:
    path: "data.csv"
    fields:
      - "do_detail_id"
    order: "sequence"
    
  target: "https://moonlay-api.dbo.dev"
  phases:
    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15


    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15


    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15


    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
      
    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
      
    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

    - duration: 1
      arrivalRate: 150
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15
    - duration: 1
      arrivalRate: 15

scenarios:
  - flow:
      - delete: 
          url: "/order-srv/delivery-orders/detail/{{ do_detail_id }}"
          headers:
            Authorization: "Basic ZGJvLW9yZGVyLXNydjpkYm8tb3JkZXItc3J2LXBhc3N3ZA=="